Revit 2026 API

# Location Methods

---

The Location type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Move | Move the element within the project by a specified vector. |
|  | Rotate | Rotate the element within the project by a specified angle around a given axis. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Location Class

Autodesk.Revit.DB Namespace